const theme = {
  palette: {
    /**활동일지 팀에서 사용한 보라색 계열 */
    primary: [
      'rgba(108, 99, 255, 1)',
      'rgba(108, 99, 255, 0.5)',
      'rgba(108, 99, 255, 0.1)',
    ],
    /**회색계열 */
    secondary: [
      'rgba(172, 172, 172, 1)',
      'rgba(172, 172, 172, 0.5)',
      'rgba(172, 172, 172, 0.1)',
    ],
    /**body 부분에 사용할 갈색 */
    PsCocoa: [
      'rgba(179,146,131,1)',
      'rgba(179,146,131,0.5)',
      'rgba(179,146,131,0.1)',
    ],
    /**header 부분에 새용할 연두색 */
    PsGreen: [
      'rgba(183,227,156,1)',
      'rgba(183,227,156,0.5)',
      'rgba(183,227,156,0.1)',
    ],
    /**폰트에 적용할 노란색 */
    PsYellow: ['rgba(250,250,210,1)'],
    /**input box에 사용할 밝은 갈색 */
    PsLightBrown: ['rgba(247, 232, 211,1)', 'rgba(247, 232, 211,0.5)'],
    /**버튼 색깔에 사용할 어두운 갈색 */
    PsBtn: ['rgba(128, 108, 99, 0.8)'],
  },
};

export default theme;
